samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
#include "sik_radio_test.h" 
#include "stm32f4xx_it.h" 

extern "C"
{
    // For C headers without C++ guards 
    #include "common/mavlink.h" 
}

//=======================================================================================


//=======================================================================================
// Macros 

#define SIK_TEST_MSG_BUFF_SIZE 500 
#define SIK_TEST_SYS_ID 1            // GCS IDs start at 255, systems start at 1 

// Periodic timing data 
// - ARR = Auto Reload Register - number of counts before periodic timer resets. 
// - SIK_TEST_PRESCALAR must coordinate with the timer_us_prescalars_t type used in the 
//   periodic timer init. 
// - SIK_TEST_INT_PERIOD is the period in ms of the periodic interrupt. This is used 
//   to find the timer count limit when the GCS requests a certain message rate. 
#define SIK_TEST_ARR 2500 
#define SIK_TEST_PRESCALAR 10000 
#define SIK_TEST_INT_PERIOD SIK_TEST_ARR * S_TO_MS / SIK_TEST_PRESCALAR 

#define SIK_TEST_HB_FREQ 1       // Heartbeat message send frequency 
#define SIK_TEST_HB_TIMEOUT 40   // Heartbeat message timeout - adjust with interrupt period 
#define SIK_TEST_AT_TIMEOUT 20   // AT mode timeout - adjust with interrupt period 

// Mock data 
#define SIK_TEST_MOCK_BOOT_TIME 100 
#define SIK_TEST_MOCK_LAT 506132700 
#define SIK_TEST_MOCK_LON -1151237700 
#define SIK_TEST_MOCK_ALTITUDE 50 
#define SIK_TEST_MOCK_NUM_SATELLITES 4 

//=======================================================================================


//=======================================================================================
// Global data 

// User & device serial interface data 
struct sik_serial_data_t 
{
    USART_TypeDef *uart; 
    DMA_Stream_TypeDef *dma_stream; 
    uint8_t cb[SIK_TEST_MSG_BUFF_SIZE];              // Circular buffer populated by DMA 
    cb_index_t cb_index;                             // Circular buffer indexing info 
    dma_index_t dma_index;                           // DMA transfer indexing info 
    uint8_t data_in_buff[SIK_TEST_MSG_BUFF_SIZE];    // Buffer that stores latest UART input 
    uint8_t data_out_buff[SIK_TEST_MSG_BUFF_SIZE];   // Buffer that stores outgoing data 
    uint16_t data_in_index;                          // Data input buffer index 
}; 

static sik_serial_data_t radio_data; 
static sik_serial_data_t user_data; 


// MAVLink messages 
struct sik_mavlink_msgs_t 
{
    // Messages 
    mavlink_heartbeat_t heartbeat_msg; 
    mavlink_request_data_stream_t request_data_stream_msg; 
    mavlink_raw_imu_t raw_imu_msg; 
    mavlink_gps_raw_int_t gps_raw_int_msg; 
    mavlink_gps_status_t gps_status_msg; 
    mavlink_control_system_state_t control_system_state_msg; 
    mavlink_rc_channels_scaled_t rc_channels_scaled_msg; 
    mavlink_rc_channels_raw_t rc_channels_raw_msg; 
    mavlink_servo_output_raw_t servo_output_raw_msg; 
    mavlink_attitude_t attitude_msg; 
    mavlink_position_target_global_int_t position_target_global_int_msg; 
    mavlink_nav_controller_output_t nav_controller_output_msg; 
    mavlink_local_position_ned_t local_position_ned_msg; 
    mavlink_global_position_int_t global_pos_int_msg; 

    // Message send timers 
    uint8_t heartbeat_msg_timer; 
    uint8_t raw_imu_msg_timer; 
    uint8_t gps_raw_int_msg_timer; 
    uint8_t gps_status_msg_timer; 
    uint8_t control_system_state_msg_timer; 
    uint8_t rc_channels_scaled_msg_timer; 
    uint8_t rc_channels_raw_msg_timer; 
    uint8_t servo_output_raw_msg_timer; 
    uint8_t attitude_msg_timer; 
    uint8_t position_target_global_int_msg_timer; 
    uint8_t nav_controller_output_msg_timer; 
    uint8_t local_position_ned_msg_timer; 
    uint8_t global_pos_int_msg_timer; 

    // Message send timer limits 
    uint8_t heartbeat_msg_timer_lim; 
    uint8_t raw_imu_msg_timer_lim; 
    uint8_t gps_raw_int_msg_timer_lim; 
    uint8_t gps_status_msg_timer_lim; 
    uint8_t control_system_state_msg_timer_lim; 
    uint8_t rc_channels_scaled_msg_timer_lim; 
    uint8_t rc_channels_raw_msg_timer_lim; 
    uint8_t servo_output_raw_msg_timer_lim; 
    uint8_t attitude_msg_timer_lim; 
    uint8_t position_target_global_int_msg_timer_lim; 
    uint8_t nav_controller_output_msg_timer_lim; 
    uint8_t local_position_ned_msg_timer_lim; 
    uint8_t global_pos_int_msg_timer_lim; 
    
    // Message receive enable flags 
    uint8_t heartbeat_msg_enable                  : 1;   // HEARTBEAT 
    uint8_t raw_imu_msg_enable                    : 1;   // RAW_IMU 
    uint8_t gps_raw_int_msg_enable                : 1;   // GPS_RAW_INT 
    uint8_t gps_status_msg_enable                 : 1;   // GPS_STATUS 
    uint8_t control_system_state_msg_enable       : 1;   // CONTROL_SYSTEM_STATE 
    uint8_t rc_channels_scaled_msg_enable         : 1;   // RC_CHANNELS_SCALED 
    uint8_t rc_channels_raw_msg_enable            : 1;   // RC_CHANNELS_RAW 
    uint8_t servo_output_raw_msg_enable           : 1;   // SERVO_OUTPUT_RAW 
    uint8_t attitude_msg_enable                   : 1;   // ATTITUDE 
    uint8_t position_target_global_int_msg_enable : 1;   // POSITION_TARGET_GLOBAL_INT 
    uint8_t nav_controller_output_msg_enable      : 1;   // NAV_CONTROLLER_OUTPUT 
    uint8_t local_position_ned_msg_enable         : 1;   // LOCAL_POSITION_NED 
    uint8_t global_pos_int_msg_enable             : 1;   // GLOBAL_POSITION_INT 
}; 


// System data 
class SikSystemData : public sik_mavlink_msgs_t 
{
public: 
    // MAVLink identification 
    int channel; 
    uint8_t system_id; 
    uint8_t component_id; 

    // MAVLink packet handling 
    mavlink_message_t msg; 
    mavlink_status_t status; 

    // Status timers 
    uint8_t heartbeat_status_timer; 
    uint8_t at_mode_request_timer; 

    // Status flags 
    uint8_t at_mode           : 1;   // AT command mode 
    uint8_t at_mode_requested : 1;   // AT command mode requested 
    uint8_t ui_mode           : 1;   // User input mode 
    uint8_t connected         : 1;   // Radio connected 
}; 

static SikSystemData system_data; 


const char 
// Formatting 
sik_test_user_prompt[] = "\r\n>>> ", 
sik_test_overwrite[] = "\r", 
// Feedback 
sik_test_user_msgid[] = "msgid: %lu\r\n", 
// Commands 
sik_test_user_exitui[] = "exitui", 
// Status 
sik_test_at_request[] = "Requesting AT command mode... ", 
sik_test_at_confirm[] = "OK\r\n", 
sik_test_timeout_msg[] = "timeout\r\n"; 

//=======================================================================================


//=======================================================================================
// Prototypes 

