samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
// Data initialization 
void sik_radio_test_init_data(void); 

/**
 * @brief AT command mode radio input decode 
 * 
 * @details Used to decode radio input when in AT command mode. This function doesn't so 
 *          much decode as it does echo the radio input to the serial terminal for the 
 *          user to see. It's labelled as a decoding function to better align with the 
 *          other input mode functions. 
 *          
 *          When a user inputs a valid AT command while in AT command mode, the radio 
 *          should respond with the requested info. Echoing this input helps the user 
 *          configure the radio as needed. 
 */
void sik_radio_test_at_radio_decode(void); 


/**
 * @brief MAVLink mode radio input decode 
 * 
 * @details Used to decode radio input while in MAVLink mode. This function is primarily 
 *          used to decode MAVLink messages received by the radio, however if in MAVLink 
 *          mode and the user requests to go to AT command mode, this function will check 
 *          if the radio responds with an acknowledgement that it has entere AT mode. 
 */
void sik_radio_test_mavlink_radio_decode(void); 


/**
 * @brief AT command mode user input decode 
 * 
 * @details Used to decode user input when in AT command mode. Some decoding is done to 
 *          check for specific user commands but if no match is found then the user input 
 *          is forwarded to the radio. This gives the user easy control over configuring 
 *          the radio. 
 */
void sik_radio_test_at_user_decode(void); 


/**
 * @brief MAVLink mode user input decode 
 * 
 * @details Used to decode user input when in MAVLink mode. A match to specific 
 *          predefined commands is checked for. If no match is found then nothing happens.
 *          When the system is in MAVLink mode and not in user input mode then any input 
 *          will trigger user input mode and nothing else. 
 */
void sik_radio_test_mavlink_user_decode(void); 


/**
 * @brief MAVLink message payload decode 
 * 
 * @details Decodes the payload of a received MAVLink message once the received radio 
 *          data is decoded into a complete MAVLink message. A function like this is 
 *          recommended by the MAVLink documentation for identifying and handling 
 *          messages. Different messages can be added as needed. 
 */
void sik_radio_test_mavlink_payload_decode(void); 

// MAVLink received message actions 
void sik_radio_test_mavlink_request_data_stream(void); 
void sik_radio_test_mavlink_heartbeat(void); 


/**
 * @brief MAVlink mode periodic actions 
 * 
 * @details This function performs periodic actions when in MAVLink mode. 
 */
void sik_radio_test_mavlink_periodic(void); 

// MAVLink periodic actions 
void sik_radio_test_mavlink_periodic_timeout(void); 
void sik_radio_test_mavlink_periodic_send(void); 


/**
 * @brief User prompt 
 * 
 * @param user_msg : message to send to the user 
 */
void sik_radio_test_user_output(const char *user_msg); 


/**
 * @brief AT command mode request reset 
 * 
 * @param user_msg : request status message to send to the user 
 */
void sik_radio_test_at_request_reset(const char *user_msg); 


// Serialize and send MAVLink message 
void sik_radio_test_mavlink_send_msg(void); 

//=======================================================================================


//=======================================================================================
// Setup code 

void sik_radio_test_init(void)
{
    // Initialize data 
    sik_radio_test_init_data(); 

    //==================================================
    // General setup 

    // Initialize GPIO ports 
    gpio_port_init(); 

    // Periodic (counter update) interrupt timer 
    tim_9_to_11_counter_init(
        TIM9, 
        TIM_84MHZ_100US_PSC, 
        SIK_TEST_ARR,   // ARR * (100us/count) = 0.25s period 
        TIM_UP_INT_ENABLE); 
    tim_enable(TIM9); 
    
    //==================================================

    //==================================================
    // UART init 

    // UART1 init - SiK radio module 
    uart_init(
        radio_data.uart, 
        GPIOA, 
        PIN_10, 
        PIN_9, 
        UART_FRAC_84_57600, 
        UART_MANT_84_57600, 
        UART_DMA_DISABLE, 
        UART_DMA_ENABLE); 

    // UART1 interrupt init - SiK radio module - IDLE line (RX) interrupts 
    uart_interrupt_init(
        radio_data.uart, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_ENABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE); 

    // UART2 init - Serial terminal 
    uart_init(
        user_data.uart, 
        GPIOA, 
        PIN_3, 
        PIN_2, 
        UART_FRAC_42_9600, 
        UART_MANT_42_9600, 
        UART_DMA_DISABLE, 
        UART_DMA_ENABLE); 

    // UART2 interrupt init - Serial terminal - IDLE line (RX) interrupts 
    uart_interrupt_init(
        user_data.uart, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_ENABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE); 
    
    //==================================================

    //==================================================
    // DMA 

    // DMA2 stream init - UART1 - SiK radio module 
    dma_stream_init(
        DMA2, 
        radio_data.dma_stream, 
        DMA_CHNL_4, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_HI, 
        DMA_DBM_DISABLE, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_BYTE, 
        DMA_DATA_SIZE_BYTE); 

    // DMA2 stream config - UART1 - SiK radio module 
    dma_stream_config(
        radio_data.dma_stream, 
        (uint32_t)(&radio_data.uart->DR), 
        (uint32_t)radio_data.cb, 
        (uint32_t)NULL, 
        (uint16_t)SIK_TEST_MSG_BUFF_SIZE); 

