samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
    // DMA1 stream init - UART2 - Serial terminal 
    dma_stream_init(
        DMA1, 
        user_data.dma_stream, 
        DMA_CHNL_4, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_HI, 
        DMA_DBM_DISABLE, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_BYTE, 
        DMA_DATA_SIZE_BYTE); 

    // DMA1 stream config - UART2 - Serial terminal 
    dma_stream_config(
        user_data.dma_stream, 
        (uint32_t)(&user_data.uart->DR), 
        (uint32_t)user_data.cb, 
        (uint32_t)NULL, 
        (uint16_t)SIK_TEST_MSG_BUFF_SIZE); 

    // Enable DMA streams 
    dma_stream_enable(radio_data.dma_stream);   // UART1 - Sik radio 
    dma_stream_enable(user_data.dma_stream);    // UART2 - Serial terminal 

    //==================================================
    
    //==================================================
    // Initialize interrupts 

    // Initialize interrupt handler flags 
    int_handler_init(); 

    // Enable the interrupt handlers 
    nvic_config(USART1_IRQn, EXTI_PRIORITY_0);          // UART1 - SiK radio 
    nvic_config(USART2_IRQn, EXTI_PRIORITY_1);          // UART2 - Serial terminal (user input) 
    nvic_config(TIM1_BRK_TIM9_IRQn, EXTI_PRIORITY_2);   // TIM9 - periodic timer 

    //==================================================

    //==================================================
    // Device driver setup 

    sik_init(radio_data.uart); 

    //==================================================
}


// Data initialization 
void sik_radio_test_init_data(void)
{
    //==================================================
    // Serial interface data 

    // Radio data 
    radio_data.uart = USART1; 
    radio_data.dma_stream = DMA2_Stream2; 
    memset((void *)radio_data.cb, CLEAR, sizeof(radio_data.cb)); 
    radio_data.cb_index.cb_size = SIK_TEST_MSG_BUFF_SIZE; 
    radio_data.cb_index.head = CLEAR; 
    radio_data.cb_index.tail = CLEAR; 
    radio_data.dma_index.data_size = CLEAR; 
    radio_data.dma_index.ndt_old = dma_ndt_read(radio_data.dma_stream); 
    radio_data.dma_index.ndt_new = CLEAR; 
    memset((void *)radio_data.data_in_buff, CLEAR, sizeof(radio_data.data_in_buff)); 
    memset((void *)radio_data.data_out_buff, CLEAR, sizeof(radio_data.data_out_buff)); 
    radio_data.data_in_index = CLEAR; 
    
    // User data 
    user_data.uart = USART2; 
    user_data.dma_stream = DMA1_Stream5; 
    memset((void *)user_data.cb, CLEAR, sizeof(user_data.cb)); 
    user_data.cb_index.cb_size = SIK_TEST_MSG_BUFF_SIZE; 
    user_data.cb_index.head = CLEAR; 
    user_data.cb_index.tail = CLEAR; 
    user_data.dma_index.data_size = CLEAR; 
    user_data.dma_index.ndt_old = dma_ndt_read(user_data.dma_stream); 
    user_data.dma_index.ndt_new = CLEAR; 
    memset((void *)user_data.data_in_buff, CLEAR, sizeof(user_data.data_in_buff)); 
    memset((void *)user_data.data_out_buff, CLEAR, sizeof(user_data.data_out_buff)); 
    user_data.data_in_index = CLEAR; 
    
    //==================================================

    //==================================================
    // System data 
    
    system_data.channel = MAVLINK_COMM_0; 
    system_data.system_id = SIK_TEST_SYS_ID; 
    system_data.component_id = MAV_COMP_ID_AUTOPILOT1; 
    
    system_data.heartbeat_status_timer = CLEAR; 
    system_data.at_mode_request_timer = CLEAR; 
    
    system_data.at_mode = CLEAR_BIT; 
    system_data.at_mode_requested = CLEAR_BIT; 
    system_data.ui_mode = CLEAR_BIT; 
    system_data.connected = CLEAR_BIT; 
    
    //==================================================
    
    //==================================================
    // MAVLink messages 

    // This test does not read from other devices to populate system information so dummy 
    // data is initialized here. There is no real reason for choosing specific numbers 
    // besides making them valid for the message. 

    // HEARTBEAT 
    system_data.heartbeat_msg.custom_mode = CLEAR; 
    system_data.heartbeat_msg.type = MAV_TYPE_SURFACE_BOAT; 
    system_data.heartbeat_msg.autopilot = MAV_AUTOPILOT_GENERIC_MISSION_FULL; 
    system_data.heartbeat_msg.base_mode = MAV_MODE_FLAG_GUIDED_ENABLED; 
    system_data.heartbeat_msg.system_status = MAV_STATE_ACTIVE; 
    
    // RAW_IMU 
    system_data.raw_imu_msg.time_usec = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.raw_imu_msg.xacc = ZERO; 
    system_data.raw_imu_msg.yacc = ZERO; 
    system_data.raw_imu_msg.zacc = 1; 
    system_data.raw_imu_msg.xgyro = ZERO; 
    system_data.raw_imu_msg.ygyro = ZERO; 
    system_data.raw_imu_msg.zgyro = ZERO; 
    system_data.raw_imu_msg.xmag = 1; 
    system_data.raw_imu_msg.ymag = ZERO; 
    system_data.raw_imu_msg.zmag = ZERO; 
    system_data.raw_imu_msg.id = ZERO; 
    system_data.raw_imu_msg.temperature = ZERO; 
    
    // GPS_RAW_INT 
    system_data.gps_raw_int_msg.time_usec = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.gps_raw_int_msg.fix_type = GPS_FIX_TYPE_3D_FIX; 
    system_data.gps_raw_int_msg.lat = SIK_TEST_MOCK_LAT; 
    system_data.gps_raw_int_msg.lon = SIK_TEST_MOCK_LON; 
    system_data.gps_raw_int_msg.alt = SIK_TEST_MOCK_ALTITUDE; 
    system_data.gps_raw_int_msg.eph = HIGH_16BIT; 
    system_data.gps_raw_int_msg.epv = HIGH_16BIT; 
    system_data.gps_raw_int_msg.vel = HIGH_16BIT; 
    system_data.gps_raw_int_msg.cog = HIGH_16BIT; 
    system_data.gps_raw_int_msg.satellites_visible = SIK_TEST_MOCK_NUM_SATELLITES; 
    system_data.gps_raw_int_msg.alt_ellipsoid = SIK_TEST_MOCK_ALTITUDE; 
    system_data.gps_raw_int_msg.h_acc = ZERO; 
    system_data.gps_raw_int_msg.v_acc = ZERO; 
    system_data.gps_raw_int_msg.vel_acc = ZERO; 
    system_data.gps_raw_int_msg.hdg_acc = ZERO; 
    system_data.gps_raw_int_msg.yaw = ZERO; 
    
    // GPS_STATUS 
    system_data.gps_status_msg.satellites_visible = SIK_TEST_MOCK_NUM_SATELLITES; 
    memset((void *)system_data.gps_status_msg.satellite_prn, CLEAR, 20*sizeof(uint8_t)); 
    memset((void *)system_data.gps_status_msg.satellite_used, CLEAR, 20*sizeof(uint8_t)); 
    memset((void *)system_data.gps_status_msg.satellite_elevation, CLEAR, 20*sizeof(uint8_t)); 
    memset((void *)system_data.gps_status_msg.satellite_azimuth, CLEAR, 20*sizeof(uint8_t)); 
    memset((void *)system_data.gps_status_msg.satellite_snr, CLEAR, 20*sizeof(uint8_t)); 
    system_data.gps_status_msg.satellite_prn[0] = 1; 
    system_data.gps_status_msg.satellite_prn[1] = 2; 
    system_data.gps_status_msg.satellite_prn[2] = 3; 
    system_data.gps_status_msg.satellite_prn[3] = 4; 
    system_data.gps_status_msg.satellite_used[0] = 1; 
    system_data.gps_status_msg.satellite_used[0] = 1; 
    system_data.gps_status_msg.satellite_used[0] = 1; 
    system_data.gps_status_msg.satellite_used[0] = 1; 
    system_data.gps_status_msg.satellite_elevation[0] = ZERO; 
    system_data.gps_status_msg.satellite_elevation[0] = 30; 
    system_data.gps_status_msg.satellite_elevation[0] = 60; 
    system_data.gps_status_msg.satellite_elevation[0] = 90; 
    
    // CONTROL_SYSTEM_STATE 
    system_data.control_system_state_msg.time_usec = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.control_system_state_msg.x_acc = ZERO; 
    system_data.control_system_state_msg.y_acc = ZERO; 
    system_data.control_system_state_msg.z_acc = ZERO; 
    system_data.control_system_state_msg.x_vel = ZERO; 
    system_data.control_system_state_msg.y_vel = ZERO; 
    system_data.control_system_state_msg.z_vel = ZERO; 
    system_data.control_system_state_msg.x_pos = ZERO; 
    system_data.control_system_state_msg.y_pos = ZERO; 
    system_data.control_system_state_msg.z_pos = ZERO; 
    system_data.control_system_state_msg.airspeed = -1; 
    memset((void *)system_data.control_system_state_msg.vel_variance, CLEAR, 3*sizeof(float)); 
    memset((void *)system_data.control_system_state_msg.pos_variance, CLEAR, 3*sizeof(float)); 
    memset((void *)system_data.control_system_state_msg.q, CLEAR, 4*sizeof(float)); 
    system_data.control_system_state_msg.roll_rate = ZERO; 
    system_data.control_system_state_msg.pitch_rate = ZERO; 
    system_data.control_system_state_msg.yaw_rate = ZERO; 
    
    // RC_CHANNELS_SCALED 
    system_data.rc_channels_scaled_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.rc_channels_scaled_msg.port = ZERO; 
    system_data.rc_channels_scaled_msg.chan1_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan2_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan3_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan4_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan5_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan6_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan7_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.chan8_scaled = ZERO; 
    system_data.rc_channels_scaled_msg.rssi = HIGH_8BIT; 
    
    // RC_CHANNELS_RAW 
    system_data.rc_channels_raw_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.rc_channels_raw_msg.port = ZERO; 
    system_data.rc_channels_raw_msg.chan1_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan2_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan3_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan4_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan5_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan6_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan7_raw = ZERO; 
    system_data.rc_channels_raw_msg.chan8_raw = ZERO; 
    system_data.rc_channels_raw_msg.rssi = HIGH_8BIT; 
    
    // SERVO_OUTPUT_RAW 
    system_data.servo_output_raw_msg.time_usec = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.servo_output_raw_msg.port = ZERO; 
    system_data.servo_output_raw_msg.servo1_raw = ZERO; 
    system_data.servo_output_raw_msg.servo2_raw = ZERO; 
    system_data.servo_output_raw_msg.servo3_raw = ZERO; 
    system_data.servo_output_raw_msg.servo4_raw = ZERO; 
    system_data.servo_output_raw_msg.servo5_raw = ZERO; 
    system_data.servo_output_raw_msg.servo6_raw = ZERO; 
    system_data.servo_output_raw_msg.servo7_raw = ZERO; 
    system_data.servo_output_raw_msg.servo8_raw = ZERO; 
    system_data.servo_output_raw_msg.servo9_raw = ZERO; 
    system_data.servo_output_raw_msg.servo10_raw = ZERO; 
    system_data.servo_output_raw_msg.servo11_raw = ZERO; 
    system_data.servo_output_raw_msg.servo12_raw = ZERO; 
    system_data.servo_output_raw_msg.servo13_raw = ZERO; 
    system_data.servo_output_raw_msg.servo14_raw = ZERO; 
    system_data.servo_output_raw_msg.servo15_raw = ZERO; 
    system_data.servo_output_raw_msg.servo16_raw = ZERO; 
    
    // ATTITUDE 
    system_data.attitude_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.attitude_msg.roll = ZERO; 
    system_data.attitude_msg.pitch = ZERO; 
    system_data.attitude_msg.yaw = ZERO; 
    system_data.attitude_msg.rollspeed = ZERO; 
    system_data.attitude_msg.pitchspeed = ZERO; 
    system_data.attitude_msg.yawspeed = ZERO; 
    
    // POSITION_TARGET_GLOBAL_INT 
    system_data.position_target_global_int_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.position_target_global_int_msg.coordinate_frame = MAV_FRAME_GLOBAL; 
    system_data.position_target_global_int_msg.type_mask = ZERO; 
    system_data.position_target_global_int_msg.lat_int = SIK_TEST_MOCK_LAT; 
    system_data.position_target_global_int_msg.lon_int = SIK_TEST_MOCK_LON; 
    system_data.position_target_global_int_msg.alt = SIK_TEST_MOCK_ALTITUDE; 
    system_data.position_target_global_int_msg.vx = ZERO; 
    system_data.position_target_global_int_msg.vy = ZERO; 
    system_data.position_target_global_int_msg.vz = ZERO; 
    system_data.position_target_global_int_msg.afx = ZERO; 
    system_data.position_target_global_int_msg.afy = ZERO; 
    system_data.position_target_global_int_msg.afz = ZERO; 
    system_data.position_target_global_int_msg.yaw = ZERO; 
    system_data.position_target_global_int_msg.yaw_rate = ZERO; 
    
    // NAV_CONTROLLER_OUTPUT 
    system_data.nav_controller_output_msg.nav_roll = ZERO; 
    system_data.nav_controller_output_msg.nav_pitch = ZERO; 
    system_data.nav_controller_output_msg.nav_bearing = ZERO; 
    system_data.nav_controller_output_msg.target_bearing = ZERO; 
    system_data.nav_controller_output_msg.wp_dist = 200; 
    system_data.nav_controller_output_msg.alt_error = ZERO; 
    system_data.nav_controller_output_msg.aspd_error = ZERO; 
    system_data.nav_controller_output_msg.xtrack_error = ZERO; 
    
    // LOCAL_POSITION_NED 
    system_data.local_position_ned_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.local_position_ned_msg.x = ZERO; 
    system_data.local_position_ned_msg.y = ZERO; 
    system_data.local_position_ned_msg.z = ZERO; 
    system_data.local_position_ned_msg.vx = ZERO; 
    system_data.local_position_ned_msg.vy = ZERO; 
    system_data.local_position_ned_msg.vz = ZERO; 
    
    // GLOBAL_POSITION_INT 
    system_data.global_pos_int_msg.time_boot_ms = SIK_TEST_MOCK_BOOT_TIME; 
    system_data.global_pos_int_msg.lat = SIK_TEST_MOCK_LAT; 
    system_data.global_pos_int_msg.lon = SIK_TEST_MOCK_LON; 
    system_data.global_pos_int_msg.alt = SIK_TEST_MOCK_ALTITUDE; 
    system_data.global_pos_int_msg.relative_alt = SIK_TEST_MOCK_ALTITUDE; 
    system_data.global_pos_int_msg.vx = ZERO; 
    system_data.global_pos_int_msg.vy = ZERO; 
    system_data.global_pos_int_msg.vx = ZERO; 
    system_data.global_pos_int_msg.hdg = ZERO; 
    
    // Send timer counters 
    system_data.heartbeat_msg_timer = CLEAR; 
    system_data.raw_imu_msg_timer = CLEAR; 
    system_data.gps_raw_int_msg_timer = CLEAR; 
    system_data.gps_status_msg_timer = CLEAR; 
    system_data.control_system_state_msg_timer = CLEAR; 
    system_data.rc_channels_scaled_msg_timer = CLEAR; 
    system_data.rc_channels_raw_msg_timer = CLEAR; 
    system_data.servo_output_raw_msg_timer = CLEAR; 
    system_data.attitude_msg_timer = CLEAR; 
    system_data.position_target_global_int_msg_timer = CLEAR; 
    system_data.nav_controller_output_msg_timer = CLEAR; 
    system_data.local_position_ned_msg_timer = CLEAR; 
    system_data.global_pos_int_msg_timer = CLEAR; 

