samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
    // Send timer counter limits 
    system_data.heartbeat_msg_timer_lim = S_TO_MS / (SIK_TEST_HB_FREQ * SIK_TEST_INT_PERIOD); 
    system_data.raw_imu_msg_timer_lim = CLEAR; 
    system_data.gps_raw_int_msg_timer_lim = CLEAR; 
    system_data.gps_status_msg_timer_lim = CLEAR; 
    system_data.control_system_state_msg_timer_lim = CLEAR; 
    system_data.rc_channels_scaled_msg_timer_lim = CLEAR; 
    system_data.rc_channels_raw_msg_timer_lim = CLEAR; 
    system_data.servo_output_raw_msg_timer_lim = CLEAR; 
    system_data.attitude_msg_timer_lim = CLEAR; 
    system_data.position_target_global_int_msg_timer_lim = CLEAR; 
    system_data.nav_controller_output_msg_timer_lim = CLEAR; 
    system_data.local_position_ned_msg_timer_lim = CLEAR; 
    system_data.global_pos_int_msg_timer_lim = CLEAR; 
    
    // Message enable flags 
    system_data.heartbeat_msg_enable = SET_BIT; 
    system_data.raw_imu_msg_enable = CLEAR_BIT; 
    system_data.gps_raw_int_msg_enable = CLEAR_BIT; 
    system_data.gps_status_msg_enable = CLEAR_BIT; 
    system_data.control_system_state_msg_enable = CLEAR_BIT; 
    system_data.rc_channels_scaled_msg_enable = CLEAR_BIT; 
    system_data.rc_channels_raw_msg_enable = CLEAR_BIT; 
    system_data.servo_output_raw_msg_enable = CLEAR_BIT; 
    system_data.attitude_msg_enable = CLEAR_BIT; 
    system_data.position_target_global_int_msg_enable = CLEAR_BIT; 
    system_data.nav_controller_output_msg_enable = CLEAR_BIT; 
    system_data.local_position_ned_msg_enable = CLEAR_BIT; 
    system_data.global_pos_int_msg_enable = CLEAR_BIT; 
    
    //==================================================
}

//=======================================================================================


//=======================================================================================
// Test code 

void sik_radio_test_app(void)
{
    // New SiK radio module data received 
    if (handler_flags.usart1_flag)
    {
        handler_flags.usart1_flag = CLEAR_BIT; 

        // Parse the new radio data from the circular buffer into the data buffer. 
        dma_cb_index(radio_data.dma_stream, &radio_data.dma_index, &radio_data.cb_index); 
        cb_parse(radio_data.cb, &radio_data.cb_index, radio_data.data_in_buff); 

        // Choose an action based on whether the radio is in AT command mode or not. 
        if (system_data.at_mode)
        {
            sik_radio_test_at_radio_decode(); 
        }
        else 
        {
            sik_radio_test_mavlink_radio_decode(); 
        }
    }

    // New serial terminal (user input) data received 
    if (handler_flags.usart2_flag)
    {
        handler_flags.usart2_flag = CLEAR_BIT; 

        // Parse the new user message from the circular buffer into the data buffer 
        dma_cb_index(user_data.dma_stream, &user_data.dma_index, &user_data.cb_index); 
        cb_parse(user_data.cb, &user_data.cb_index, user_data.data_in_buff); 

        // Choose an action based on whether the radio is in AT command mode or not. 
        if (system_data.at_mode)
        {
            sik_radio_test_at_user_decode(); 
        }
        else 
        {
            sik_radio_test_mavlink_user_decode(); 
        }
    }
    
    // Periodic interrupt 
    if (handler_flags.tim1_brk_tim9_glbl_flag)
    {
        handler_flags.tim1_brk_tim9_glbl_flag = CLEAR_BIT; 

        // Only perform MAVLink actions when the SiK radio is not in AT command mode. 
        if (!system_data.at_mode)
        {
            sik_radio_test_mavlink_periodic(); 
        }
    }
}

//=======================================================================================


//=======================================================================================
// Serial input decoding and actions 

// AT command mode radio input decode 
void sik_radio_test_at_radio_decode(void)
{
    // Echo the AT response from the radio to the serial terminal for the user to see. A 
    // prompt will be output after the user enters anything so it needs to be overwritten 
    // to make way for the radio response. 
    sik_radio_test_user_output(sik_test_overwrite); 
    sik_radio_test_user_output((char *)radio_data.data_in_buff); 
    sik_radio_test_user_output(sik_test_user_prompt); 
}


// MAVLink mode radio input decode 
void sik_radio_test_mavlink_radio_decode(void)
{
    radio_data.data_in_index = CLEAR; 

    // Besides a MAVLink message, the only other data received from the radio in MAVLink 
    // mode is an AT command mode enter response (assuming the user doesn't configure the 
    // radio to not use MAVLink). This is only checked for right after the user requests 
    // to go to AT command mode. 
    if (system_data.at_mode_requested)
    {
        if (str_compare(sik_at_enter_resp, (char *)user_data.data_in_buff, BYTE_0))
        {
            system_data.at_mode = SET_BIT; 
            sik_radio_test_at_request_reset(sik_test_at_confirm); 
        }
    }

    // Look at each byte of the received data and try to decode MAVLink messages 
    // until there is no more data to check. 
    while (radio_data.data_in_index < radio_data.dma_index.data_size)
    {
        if (mavlink_parse_char(
                system_data.channel, 
                radio_data.data_in_buff[radio_data.data_in_index++], 
                &system_data.msg, 
                &system_data.status))
        {
            // MAVLink message has been successfully decoded. Proceed to decode the 
            // message payload. Note that this can happen more than once if multiple 
            // messages are received or not at all if a valid message can't be decoded. 

            if (!system_data.ui_mode)
            {
                // If not in user input mode then display the message ID for the user to 
                // see. This is done here so all received messages are shown to the user 
                // even if the message payload is not meant to be decoded. 
                snprintf((char *)user_data.data_out_buff, 
                         SIK_TEST_MSG_BUFF_SIZE, 
                         sik_test_user_msgid, 
                         (uint32_t)system_data.msg.msgid); 
                sik_radio_test_user_output((char *)user_data.data_out_buff); 
            }

            sik_radio_test_mavlink_payload_decode(); 
        }
    }
}


// AT command mode user input decode 
void sik_radio_test_at_user_decode(void)
{
    // Take the user input while in AT command mode and try to match it to one of the 
    // predefined commands available in this test. If no command is matched then the 
    // input is sent as is to the radio and a new prompt will be displayed. Any response 
    // from the radio will be echoed to the serial terminal for the user to see. 
    if (str_compare(sik_ato_cmd, (char *)user_data.data_in_buff, BYTE_0))
    {
        // Exit AT command mode 
        sik_at_mode(SIK_AT_EXIT); 
        system_data.at_mode = CLEAR_BIT; 
    }
    else 
    {
        // Send input as is to the radio 
        sik_send_data((char *)user_data.data_in_buff); 
    }

    sik_radio_test_user_output(sik_test_user_prompt); 
}


// MAVLink mode user input decode 
void sik_radio_test_mavlink_user_decode(void)
{
    // When AT command mode has been requested by the user then block and other inputs 
    // from being registered until either AT command mode has been entered or the 
    // request has timed out (either way the AT command request flag is cleared). 
    if (system_data.at_mode_requested)
    {
        return; 
    }

