samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
    // When not waiting on AT command mode response and in MAVLink mode then look to 
    // match the user input to a predefined response. If no match is found then a 
    // new prompt will be displayed without any action or acknowledgement. 
    if (!system_data.ui_mode)
    {
        // If this is true then it means the code is in MAVLink mode (i.e. not AT 
        // command mode), all incoming messages are being displayed for the user to see 
        // and the user has provided any input via the serial terminal. This case will 
        // make it so messages will stop being displayed giving the user an opportunity 
        // to provide uninterrupted input (i.e. user input mode). 
        system_data.ui_mode = SET_BIT; 
        sik_radio_test_user_output(sik_test_user_prompt); 
    }
    else if (str_compare(sik_test_user_exitui, (char *)user_data.data_in_buff, BYTE_0))
    {
        // Exit user input mode 
        system_data.ui_mode = CLEAR_BIT; 
    }
    else if (str_compare(sik_at_enter_cmd, (char *)user_data.data_in_buff, BYTE_0))
    {
        // Submit an AT command mode request 
        sik_at_mode(SIK_AT_ENTER); 
        system_data.at_mode_requested = SET_BIT; 
        sik_radio_test_user_output(sik_test_at_request); 
    }
    else 
    {
        // No matching action found. Do nothing. 
        sik_radio_test_user_output(sik_test_user_prompt); 
    }
}

//=======================================================================================


//=======================================================================================
// MAVLink payload decoding and actions 

// MAVLink message payload decode 
void sik_radio_test_mavlink_payload_decode(void)
{
    switch (system_data.msg.msgid)
    {
        case MAVLINK_MSG_ID_HEARTBEAT: 
            sik_radio_test_mavlink_heartbeat(); 
            break; 

        case MAVLINK_MSG_ID_REQUEST_DATA_STREAM: 
            sik_radio_test_mavlink_request_data_stream(); 
            break; 
        
        case MAVLINK_MSG_ID_COMMAND_INT: 
            // Call a separate function to decode mavlink_command_int_t.command 
            break; 
        
        case MAVLINK_MSG_ID_COMMAND_LONG: 
            // Call a separate function to decode mavlink_command_long_t.command 
            break; 
        
        default: 
            break; 
    }
}


// MAVLink HEARTBEAT message actions 
void sik_radio_test_mavlink_heartbeat(void)
{
    mavlink_msg_heartbeat_decode(
        &system_data.msg, 
        &system_data.heartbeat_msg); 
    system_data.heartbeat_status_timer = CLEAR; 
    system_data.connected = SET_BIT; 
}


// MAVLink REQUEST_DATA_STREAM message actions 
void sik_radio_test_mavlink_request_data_stream(void)
{
    // Mission Planner sends this message to request data from the autopilot. 
    // When attempting to connect, this message will be sent in rapid succession. 

    mavlink_msg_request_data_stream_decode(
        &system_data.msg, 
        &system_data.request_data_stream_msg); 

    // This message comes with a cooresponding requested message rate. The calculated 
    // timer counter limit is the same calculation for each requested message so it's 
    // done once here and assigned to the requested message. Note that the periodic 
    // interrupt period should be equipped to handle whatever the requested rate is. 
    uint8_t timer_limit = (uint8_t)(S_TO_MS / 
        (system_data.request_data_stream_msg.req_message_rate * SIK_TEST_INT_PERIOD)); 
    uint8_t enable = system_data.request_data_stream_msg.start_stop; 

    // Enable/disable the requested message and assign the message timer counter limit 
    // so it gets sent to the GCS at the requested rate. 
    switch (system_data.request_data_stream_msg.req_stream_id)
    {
        case MAV_DATA_STREAM_ALL: 
            break; 
        
        case MAV_DATA_STREAM_RAW_SENSORS: 
            system_data.raw_imu_msg_enable = enable; 
            system_data.gps_raw_int_msg_enable = enable; 
            system_data.gps_status_msg_enable = enable; 
            system_data.raw_imu_msg_timer_lim = timer_limit; 
            system_data.gps_raw_int_msg_timer_lim = timer_limit; 
            system_data.gps_status_msg_timer_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_EXTENDED_STATUS: 
            system_data.gps_status_msg_enable = enable; 
            system_data.control_system_state_msg_enable = enable; 
            system_data.gps_status_msg_timer_lim = timer_limit; 
            system_data.control_system_state_msg_timer_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_RC_CHANNELS: 
            system_data.rc_channels_scaled_msg_enable = enable; 
            system_data.rc_channels_raw_msg_enable = enable; 
            system_data.servo_output_raw_msg_enable = enable; 
            system_data.rc_channels_scaled_msg_timer_lim = timer_limit; 
            system_data.rc_channels_raw_msg_timer_lim = timer_limit; 
            system_data.servo_output_raw_msg_timer_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_RAW_CONTROLLER: 
            system_data.attitude_msg_enable = enable; 
            system_data.position_target_global_int_msg_enable = enable; 
            system_data.nav_controller_output_msg_enable = enable; 
            system_data.attitude_msg_timer_lim = timer_limit; 
            system_data.position_target_global_int_msg_timer_lim = timer_limit; 
            system_data.nav_controller_output_msg_timer_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_POSITION: 
            system_data.local_position_ned_msg_enable = enable; 
            system_data.local_position_ned_msg_timer_lim = timer_limit; 
            system_data.global_pos_int_msg_enable = enable; 
            system_data.global_pos_int_msg_timer_lim = timer_limit; 
            break; 

        case MAV_DATA_STREAM_EXTRA1: 
            break; 

        case MAV_DATA_STREAM_EXTRA2: 
            break; 

        case MAV_DATA_STREAM_EXTRA3: 
            break; 

        default: 
            break; 
    }

    snprintf((char *)user_data.data_out_buff, 
        SIK_TEST_MSG_BUFF_SIZE, 
        "system: %u, component: %u, stream: %u, rate: %u, start/stop: %u\r\n", 
        system_data.request_data_stream_msg.target_system, 
        system_data.request_data_stream_msg.target_component, 
        system_data.request_data_stream_msg.req_stream_id, 
        system_data.request_data_stream_msg.req_message_rate, 
        system_data.request_data_stream_msg.start_stop); 
    sik_radio_test_user_output((char *)user_data.data_out_buff);    
}

//=======================================================================================


//=======================================================================================
// Periodic actions 

// MAVlink mode periodic actions 
void sik_radio_test_mavlink_periodic(void)
{
    // Everything here is performed periodically when in MAVLink mode. 
    sik_radio_test_mavlink_periodic_timeout(); 
    sik_radio_test_mavlink_periodic_send(); 
}


// MAVLink periodic timeout check 
void sik_radio_test_mavlink_periodic_timeout(void)
{
    // Check for a connection (heartbeat) timeout 
    if (system_data.heartbeat_status_timer++ >= SIK_TEST_HB_TIMEOUT)
    {
        // Have not seen a heartbeat message from a GCS for too long. The system is 
        // considered to be disconnected. 
        system_data.heartbeat_status_timer--; 
        system_data.connected = CLEAR_BIT; 
    }

    // Check for an AT command mode request timeout 
    if (system_data.at_mode_requested)
    {
        // If AT command mode is being requested then the code waits on the appropriate 
        // response from the radio. Waiting for this response blocks other actions so 
        // once the system has waited too long then cancel the search and return to 
        // normal MAVLink mode. 
        if (system_data.at_mode_request_timer++ >= SIK_TEST_AT_TIMEOUT)
        {
            sik_radio_test_at_request_reset(sik_test_timeout_msg); 
            sik_at_mode(SIK_AT_EXIT); 
        }
    }
}


// MAVLink message periodic send 
void sik_radio_test_mavlink_periodic_send(void)
{
    // Check if any of the enabled periodic messages must be sent 

    // HEARTBEAT 
    if (system_data.heartbeat_msg_enable && 
       (++system_data.heartbeat_msg_timer >= system_data.heartbeat_msg_timer_lim))
    {
        system_data.heartbeat_msg_timer = CLEAR; 
        mavlink_msg_heartbeat_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.heartbeat_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // RAW_IMU 
    if (system_data.raw_imu_msg_enable && 
       (++system_data.raw_imu_msg_timer >= system_data.raw_imu_msg_timer_lim))
    {
        system_data.raw_imu_msg_timer = CLEAR; 
        mavlink_msg_raw_imu_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.raw_imu_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // GPS_RAW_INT 
    if (system_data.gps_raw_int_msg_enable && 
       (++system_data.gps_raw_int_msg_timer >= system_data.gps_raw_int_msg_timer_lim))
    {
        system_data.gps_raw_int_msg_timer = CLEAR; 
        mavlink_msg_gps_raw_int_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.gps_raw_int_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }
    
    // GPS_STATUS 
    if (system_data.gps_status_msg_enable && 
       (++system_data.gps_status_msg_timer >= system_data.gps_status_msg_timer_lim))
    {
        system_data.gps_status_msg_timer = CLEAR; 
        mavlink_msg_gps_status_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.gps_status_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // CONTROL_SYSTEM_STATE 
    if (system_data.control_system_state_msg_enable && 
       (++system_data.control_system_state_msg_timer >= system_data.control_system_state_msg_timer_lim))
    {
        system_data.control_system_state_msg_timer = CLEAR; 
        mavlink_msg_control_system_state_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.control_system_state_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // RC_CHANNELS_SCALED 
    if (system_data.rc_channels_scaled_msg_enable && 
       (++system_data.rc_channels_scaled_msg_timer >= system_data.rc_channels_scaled_msg_timer_lim))
    {
        system_data.rc_channels_scaled_msg_timer = CLEAR; 
        mavlink_msg_rc_channels_scaled_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.rc_channels_scaled_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // RC_CHANNELS_RAW 
    if (system_data.rc_channels_raw_msg_enable && 
       (++system_data.rc_channels_raw_msg_timer >= system_data.rc_channels_raw_msg_timer_lim))
    {
        system_data.rc_channels_raw_msg_timer = CLEAR; 
        mavlink_msg_rc_channels_raw_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.rc_channels_raw_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // SERVO_OUTPUT_RAW 
    if (system_data.servo_output_raw_msg_enable && 
       (++system_data.servo_output_raw_msg_timer >= system_data.servo_output_raw_msg_timer_lim))
    {
        system_data.servo_output_raw_msg_timer = CLEAR; 
        mavlink_msg_servo_output_raw_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.servo_output_raw_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // ATTITUDE 
    if (system_data.attitude_msg_enable && 
       (++system_data.attitude_msg_timer >= system_data.attitude_msg_timer_lim))
    {
        system_data.attitude_msg_timer = CLEAR; 
        mavlink_msg_attitude_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.attitude_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // POSITION_TARGET_GLOBAL_INT 
    if (system_data.position_target_global_int_msg_enable && 
       (++system_data.position_target_global_int_msg_timer >= system_data.position_target_global_int_msg_timer_lim))
    {
        system_data.position_target_global_int_msg_timer = CLEAR; 
        mavlink_msg_position_target_global_int_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.position_target_global_int_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // NAV_CONTROLLER 
    if (system_data.nav_controller_output_msg_enable && 
       (++system_data.nav_controller_output_msg_timer >= system_data.nav_controller_output_msg_timer_lim))
    {
        system_data.nav_controller_output_msg_timer = CLEAR; 
        mavlink_msg_nav_controller_output_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.nav_controller_output_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }

    // LOCAL_POSITION_NED 
    if (system_data.local_position_ned_msg_enable && 
       (++system_data.local_position_ned_msg_timer >= system_data.local_position_ned_msg_timer_lim))
    {
        system_data.local_position_ned_msg_timer = CLEAR; 
        mavlink_msg_local_position_ned_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.local_position_ned_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }


    // GLOBAL_POSITION_INT 
    if (system_data.global_pos_int_msg_enable && 
       (++system_data.global_pos_int_msg_timer >= system_data.global_pos_int_msg_timer_lim))
    {
        system_data.global_pos_int_msg_timer = CLEAR; 
        mavlink_msg_global_position_int_encode_chan(
            system_data.system_id, 
            system_data.component_id, 
            system_data.channel, 
            &system_data.msg, 
            &system_data.global_pos_int_msg); 
        sik_radio_test_mavlink_send_msg(); 
    }
}

//=======================================================================================


//=======================================================================================
// Helper functions 

// User prompt 
void sik_radio_test_user_output(const char *user_msg)
{
    uart_send_str(user_data.uart, user_msg); 
}


// AT command mode request reset 
void sik_radio_test_at_request_reset(const char *user_msg)
{
    system_data.at_mode_request_timer = CLEAR; 
    system_data.at_mode_requested = CLEAR_BIT; 
    sik_radio_test_user_output(user_msg); 
    sik_radio_test_user_output(sik_test_user_prompt); 
}


// Serialize and send MAVLink message 
void sik_radio_test_mavlink_send_msg(void)
{
    mavlink_msg_to_send_buffer(radio_data.data_out_buff, &system_data.msg); 
    sik_send_data((char *)radio_data.data_out_buff); 
}

//=======================================================================================
